{
    "projects" : [
        {
            "image" : "images/projects/cnctflw.png",
            "title": "Amazon Connect Contact Center for Child Welfare Services",
            "bodyText": "- Designed and implemented a serverless, scalable contact center solution using Amazon Connect, AWS Lambda, DynamoDB, Lex, SES, and API Gateway to automate appointment booking, cancellation, voicemail, and emergency call routing for Child Welfare services. \n - Achieving a significant accuracy improvement of 10% over previous models like KNN, RandomForest, Linear Regression Algorithms.\n - Developed Lex bots to capture caller intents (book/reschedule/cancel appointments), with validation on working hours and dynamic availability lookup using Lambda-connected DynamoDB and Created a React-based appointment status tracker web app, backed by RESTful APIs via API Gateway and Lambda, enabling users to check real-time appointment status using Appointment ID.\n - Integrated Amazon SES to automate appointment confirmations via email, and implemented voicemail recording using Voicemail Express, routing transcripts to agents through email for unattended calls and Utilized Contact Attributes and intelligent routing to personalize call flows, handled error states gracefully, and enabled Contact Lens for sentiment tracking during live calls.",
            "links": [
                {
                 "label": "GitHub",
                 "url": "https://github.com/rakha003/ConnectAWSchildwelfareflow.git"
                }
            ],
            "tags" : [
                "Contact Lens",
                "AWS",
                "Dynamo DB",
                "AWS Simple Email Service",
                "React",
                "Git",
                "LEX",
                "RESTful API's, API Gateway",
                "AWS"
            ]
        },
        {
            "image" : "images/projects/prt.png",
            "title": "Portfolio Website",
            "bodyText": "- Analyst Portfolio Website made in React\n -  Fully customisable and dynamic, easily change data and images.\n - Dark Mode Support",
            "links": [
                
            ],
            "tags" : [
                "JavaScript",
                "Portfolio",
                "React"
            ]
        },
        {
            "image" : "images/projects/hrt.png",
            "title": " Stroke Prediction And Analysis",
            "bodyText": "- Led the development of predictive analysis for early identification of stroke risk using data mining techniques and Knime software\n - Resulting in the implementation of logistic regression, decision tree, and neural network models with 95.303% accuracy\n ",
            "links": [
            ],
            "tags" : [
                "Python",
                "Knime",
                "Machine Learning",
                "Data Analysis",
                "Power BI",
                "Logistic Regression",
                "Decision Tree",
                "Neural Networks"
            ]
        },
        {
            "image" : "images/projects/bsp.png",
            "title": "Big Mart Sales Prediction",
            "bodyText": "- Developed a Product Sale Prediction application utilizing XGBoost Machine Learning algorithm in Python.\n - Achieving a significant accuracy improvement of 10% over previous models like KNN, RandomForest, Linear Regression Algorithms.\n - Created a Power BI dashboard for a retail client to visualize sales data. The dashboard provided insights into sales trends, inventory levels, and customer preferences, resulting in a 15% increase in sales efficiency..",
            "links": [
            ],
            "tags" : [
                "Python",
                "Machinen Learning",
                " Artificial Intelligence",
                "Power BI",
                "Random Forest Algorith",
                "Linear Regression Algorithm",
                "K Nearest Neighbors Algorithm"
            ]
        },
        {
             "image" : "images/projects/ccw.png",
            "title": " Classification of Crop and Weed",
            "bodyText": "- Worked on image classification using Convolutional Neural Networks (CNN) algorithm implemented with Python Technology.",
            "links": [
               
            ],
            "tags" : [
                "Python",
                "Convolutional Neural Network (CNN)",
                "Machine Learning"
            ]
        },
        {
            "image" : "images/projects/foa.png",
            "title": "Data Analytics and Visualization Job Simulation, Accenture, Forage",
            "bodyText": "- Successfully Completed Data Analytics and Visualization Job Simulation which was conducted by Accenture, Forage.",
            "links": [
            ],
            "tags" : [
                "Project Unerstanding",
                "Data Cleaning",
                "Data Modelling",
                "Data Visualization and Story Telling",
                "Presentations to the client"
            ]
        },
        {
            "title": "End-to-End Database Design for a Brewing Company",
            "bodyText": "-   Led the complete life cycle of database development for a brewing company, starting from initial data modeling to the final database implementation.\n - Utilized SQL and MySQL to transform the conceptual database design into a fully functional and relational database system..",
            "links": [
               
            ],
            "tags" : [
                "Data Modelling",
                "Microsoft SQL Server",
                "MYSQL"
            ]
        },
        {
            "image" : "images/projects/cvt.png",
            "title": "Analysis of COVID-19 Vaccination Trends (2021) Using Tableau",
            "bodyText": "-• Designed and developed a comprehensive Tableau Dashboard utilizing a COVID Vaccination 2021 dataset to present critical insights and trends.",
            "links": [
            ],
            "tags" : [
                "Tableau",
                "Data Analysis",
                "Data Cleaning"
            ]
        },
        {
            "title": "Strategic Business Modeling for an Intelligent Vending Machines Venture using UML",
            "bodyText": "-• Formulated a comprehensive business model for an innovative Intelligent Vending Machines concept, aligning high-level objectives with practical implementation strategies. \n Translated conceptual business goals into tangible UML diagrams, including Use Case, Activity, Sequence, and Class diagrams, to visualize the end-to-end operational framework.",
            "links": [
            ],
            "tags" : [
                "Business Process Modelling Notation",
                "Business Process Design",
                "Unified Modelling Language"
            ]
        },
        {
            "title": "Integrated Sales Analytics: Building Data Marts, Data Mining, and Visualizations",
            "bodyText": "-Developed interactive visualizations within Power BI to showcase sales analytics dynamically, empowering stakeholders to engage with data and extract actionable insights",
            "links": [
            ],
            "tags" : [
                "Microsoft Power BI",
                "Power Point"
            ]
        },
        {
            "title": "Migrating to Cloud-Based Database Systems: A Comprehensive Guide",
            "bodyText": "-This Executive Brief talks about the challenges associated with on-premises database management systems and the benefits of migrating from in-house systems to cloud-based database systems. \n The information outlined in this brief will help organizations select a cloud-based database services provider and the right location for implementing it.",
            "links": [
            ],
            "tags" : [
                
            ]
        }
       
    ]
}